# AddAssociation

## Description
```pascal
FUNCTION AddAssociation(
				ioOwnerObj  : HANDLE;
				inKind      : INTEGER;
				ioTargetObj : HANDLE) : BOOLEAN;
```

```python

def vs.AddAssociation(ioOwnerObj, inKind, ioTargetObj):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ioOwnerObj|HANDLE||
|inKind|INTEGER||
|ioTargetObj|HANDLE||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events